#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/csepulveda_io/AWSBaseSetup/runs/run-4eSmDVSRRqH5UXLE

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.aws_static_website.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:107584640829:certificate/35d640b2-5ceb-4f89-88f3-889cde860c79]
aws_iam_policy.cluster-autoscaler: Refreshing state... [id=arn:aws:iam::107584640829:policy/EKS-Cluster-Autoscaler]
aws_route53_zone.primary: Refreshing state... [id=Z09309173TX5H4I19KYIU]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-042664948f4bb4b4e]
module.aws_static_website.aws_s3_bucket.website_logs: Refreshing state... [id=csepulveda.io-logs]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=cluster120210624002121633900000002]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::107584640829:policy/cluster1-elb-sl-role-creation20210624002121619600000001]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=cluster120210624002121633900000002-20210624002121846800000005]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=cluster120210624002121633900000002-20210624002121844100000003]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=cluster120210624002121633900000002-20210624002121845200000004]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=cluster120210624002121633900000002-20210624002121871600000006]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0af3b9f319452df47]
module.aws_static_website.aws_route53_record.wildcard_validation["*.csepulveda.io"]: Refreshing state... [id=Z09309173TX5H4I19KYIU__b5d5fb2e388042f78fd19d630ef16304.csepulveda.io._CNAME]
module.aws_static_website.aws_route53_record.wildcard_validation["csepulveda.io"]: Refreshing state... [id=Z09309173TX5H4I19KYIU__b5d5fb2e388042f78fd19d630ef16304.csepulveda.io._CNAME]
module.aws_static_website.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-06-22 16:18:26 +0000 UTC]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0d73c5c94bc0c46de]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-021e41c60e9524619]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0eac23a80f6e7f302]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0065fba71db9ede92]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02f964419bf7ff82f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-01b472ffc7c509517]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0ab7380eead9d368e]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-035a4a8564eb5bf8e]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-08714bc3d49e73257]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-073ba6816aec4f180]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08975de3a8b3487f4]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0bb8bd2035526ed58]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0138a448a687f4151]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-073386c8a212599ce]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0deb00bfb11d22021]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0ee45b89ecb268c9a]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0a5e67af7b849da95]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=k8s-vpc]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-3385609347]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-1085117081]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-4093119529]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05567d92b013f4bcc]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0fc5c96d2945f1b95]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0249e54818227d53a]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1200664204]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-1560984072]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-3316967326]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0cefe35dca5a0efd0]
module.aws_static_website.aws_s3_bucket.website_redirect: Refreshing state... [id=csepulveda.io-redirect]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f72787c313f9df05]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05df3404f19a502ea]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e09e94a750bc7948]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-073ba6816aec4f1801080289494]
module.aws_static_website.aws_s3_bucket.website_root: Refreshing state... [id=csepulveda.io-root]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=cluster1]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0eac23a80f6e7f3021080289494]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::107584640829:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/9CF5841646B134138EF413B34DA7D846]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=cluster120210624003327308700000009]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=cluster120210624003327308700000009-2021062400332754270000000d]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=cluster12021062400332747200000000a]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=cluster120210624003327308700000009-2021062400332752150000000b]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=cluster120210624003327308700000009-2021062400332752840000000c]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=cluster1-020210625145023915500000001]
aws_iam_role.autoscaler_role: Refreshing state... [id=cluster-autoscaler-aws]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=cluster1-02021062400333852870000000f]
helm_release.cluster-autoscaler: Refreshing state... [id=cluster-autoscaler]
module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.aws_static_website.aws_cloudfront_distribution.website_cdn_redirect: Refreshing state... [id=E80BFWFSTH9N8]
module.aws_static_website.aws_s3_bucket_policy.update_website_root_bucket_policy: Refreshing state... [id=csepulveda.io-root]
module.aws_static_website.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=E1GON5LWI0YJQ8]
module.aws_static_website.aws_route53_record.website_cdn_redirect_record: Refreshing state... [id=Z09309173TX5H4I19KYIU_blog.csepulveda.io_A]
module.aws_static_website.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z09309173TX5H4I19KYIU_csepulveda.io_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.aws_launch_configuration.workers[0] has been changed
  ~ resource "aws_launch_configuration" "workers" {
        id                               = "cluster1-020210625145023915500000001"
        name                             = "cluster1-020210625145023915500000001"
      + vpc_classic_link_security_groups = []
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.eks.aws_autoscaling_group.workers[0] has been changed
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "cluster1-02021062400333852870000000f"
      ~ max_size                  = 10 -> 20
        name                      = "cluster1-02021062400333852870000000f"
        # (23 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "cluster1-02021062400333852870000000f"
      ~ launch_configuration      = "cluster1-020210625145023915500000001" -> (known after apply)
      ~ min_size                  = 1 -> 2
        name                      = "cluster1-02021062400333852870000000f"
        # (22 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:us-west-2:107584640829:launchConfiguration:2212d7cf-f31d-43b5-869b-a8124d0ee183:launchConfigurationName/cluster1-020210625145023915500000001" -> (known after apply)
      ~ id                               = "cluster1-020210625145023915500000001" -> (known after apply)
      ~ instance_type                    = "t3a.nano" -> "t3.small" # forces replacement
      + key_name                         = (known after apply)
      ~ name                             = "cluster1-020210625145023915500000001" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.


```
</details>
*Pusher: @csepulveda, Action: `pull_request`*